------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Lorena\Documents\curso python-ML-EC\ECO\dif dif pc\preg2.log
  log type:  text
 opened on:  11 Feb 2024, 23:49:05

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. clear

. 
. use "C:/Users/Lorena/Documents/curso python-ML-EC/ECO/dif dif pc/base.dta",clear

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |     13,746    54.52459    27.13489         11         95
        year |     13,746    1993.347    1.703207       1991       1996
       urate |     13,746    6.761734    1.462464        2.6       11.4
    children |     13,746    1.192638    1.382105          0          9
    nonwhite |     13,746    .6006838    .4897757          0          1
-------------+---------------------------------------------------------
        finc |     13,746    15255.32    19444.25          0   575616.8
        earn |     13,746    10432.48    18200.76          0   537880.6
         age |     13,746    35.20966    10.15713         20         54
          ed |     13,746    8.806053    2.635639          0         11
        work |     13,746     .513022    .4998486          0          1
-------------+---------------------------------------------------------
      unearn |     13,746    4.822844    7.122624          0   134.0575

. table state

----------------------
State of  |
Residence |      Freq.
----------+-----------
       11 |         76
       12 |         70
       13 |         52
       14 |        374
       15 |        146
       16 |        104
       21 |      1,620
       22 |        504
       23 |        412
       31 |        428
       32 |        121
       33 |        597
       34 |        463
       35 |        128
       41 |         71
       42 |         76
       43 |        136
       44 |         67
       45 |        103
       46 |         77
       47 |         85
       51 |         99
       52 |        131
       53 |        266
       54 |        164
       55 |        162
       56 |        435
       57 |        205
       58 |        219
       59 |        718
       61 |        164
       62 |        187
       63 |        178
       64 |        263
       71 |        126
       72 |        229
       73 |        133
       74 |        906
       81 |         72
       82 |         95
       83 |         51
       84 |        119
       85 |        265
       86 |        204
       87 |         69
       88 |        146
       91 |         87
       92 |        120
       93 |      2,086
       94 |         71
       95 |         66
----------------------

. describe children

              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
children        byte    %8.0g                 Number of Children

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. summarize state year urate nonwhite finc earn age ed work unearn if children ==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |      5,927    53.39666    26.40429         11         95
        year |      5,927    1993.365    1.700611       1991       1996
       urate |      5,927    6.663067    1.480953        2.6       11.4
    nonwhite |      5,927     .515944    .4997879          0          1
        finc |      5,927    18559.86    23041.78          0   575616.8
-------------+---------------------------------------------------------
        earn |      5,927    13760.26     21301.4          0   537880.6
         age |      5,927    38.49823    11.04638         20         54
          ed |      5,927    8.548676    2.888691          0         11
        work |      5,927    .5744896    .4944619          0          1
      unearn |      5,927    4.799607    8.495665          0   134.0575

. 
. *b) Con 1 hijos
. 
. summarize state year urate nonwhite finc earn age ed work unearn if children ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |      3,058    55.59091    27.33653         11         95
        year |      3,058    1993.338    1.717959       1991       1996
       urate |      3,058     6.80206    1.449963        2.6       11.4
    nonwhite |      3,058    .5964683    .4906859          0          1
        finc |      3,058    13941.57    18551.76          0   410507.6
-------------+---------------------------------------------------------
        earn |      3,058    9928.279    17536.87          0   366095.5
         age |      3,058    33.75899    9.901038         20         54
          ed |      3,058    8.992479    2.396625          0         11
        work |      3,058    .5376063    .4986653          0          1
      unearn |      3,058    4.013291    5.735145          0   102.9579

. 
. *c) Con 2 a más hijos
. 
. summarize state year urate nonwhite finc earn age ed work unearn if children >=2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       state |      4,761    55.24386    27.84643         11         95
        year |      4,761     1993.33    1.697045       1991       1996
       urate |      4,761    6.858664    1.439712        2.6       11.4
    nonwhite |      4,761    .7088847    .4543243          0          1
        finc |      4,761     11985.3    13576.81          0   231489.5
-------------+---------------------------------------------------------
        earn |      4,761    6613.547    12869.32          0   162443.6
         age |      4,761    32.04747    7.629929         20         54
          ed |      4,761    9.006721    2.415887          0         11
        work |      4,761    .4207099    .4937249          0          1
      unearn |      4,761    5.371749    5.898279          0   81.29683

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. generate anykids= 1 if children >=1 
(5,927 missing values generated)

. replace anykids =0 if missing(anykids)
(5,927 real changes made)

. 
. generate post93 =1 if year >= 1994
(7,401 missing values generated)

. replace post93= 0 if missing(post93)
(7,401 real changes made)

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. gen post_treatment = post93*anykids

. 
. reg earn post93 anykids post_treatment, robust

Linear regression                               Number of obs     =     13,746
                                                F(3, 13742)       =     130.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0264
                                                Root MSE          =      17961

--------------------------------------------------------------------------------
               |               Robust
          earn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        post93 |  -81.86829   562.8924    -0.15   0.884    -1185.214    1021.478
       anykids |  -6613.536   390.2787   -16.95   0.000    -7378.536   -5848.537
post_treatment |   1668.678   661.0365     2.52   0.012      372.956      2964.4
         _cons |   13798.56    334.906    41.20   0.000      13142.1    14455.02
--------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. reg earn post93 anykids post_treatment i.state i.year, robust
note: 1996.year omitted because of collinearity

Linear regression                               Number of obs     =     13,746
                                                F(57, 13688)      =      11.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0438
                                                Root MSE          =      17835

--------------------------------------------------------------------------------
               |               Robust
          earn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        post93 |  -67.25288   755.4199    -0.09   0.929     -1547.98    1413.474
       anykids |   -6646.04   389.7225   -17.05   0.000     -7409.95   -5882.131
post_treatment |   1612.131   660.8852     2.44   0.015     316.7054    2907.557
               |
         state |
           12  |   4924.939   1649.534     2.99   0.003     1691.625    8158.253
           13  |     2982.8   1981.551     1.51   0.132    -901.3121    6866.913
           14  |   6323.047   1560.169     4.05   0.000     3264.902    9381.192
           15  |   7938.127   1886.949     4.21   0.000     4239.447    11636.81
           16  |   5065.854   1547.576     3.27   0.001     2032.392    8099.315
           21  |   4465.167   1009.135     4.42   0.000     2487.123    6443.211
           22  |   8801.242    1293.79     6.80   0.000     6265.236    11337.25
           23  |   4516.542   1195.167     3.78   0.000      2173.85    6859.234
           31  |    3455.95   1105.957     3.12   0.002     1288.123    5623.778
           32  |   9060.525   1750.633     5.18   0.000     5629.044    12492.01
           33  |   7591.078   1249.519     6.08   0.000     5141.849    10040.31
           34  |   6775.102   1355.556     5.00   0.000     4118.025    9432.179
           35  |   3932.981   1342.951     2.93   0.003     1300.613    6565.349
           41  |   1437.995   1462.706     0.98   0.326    -1429.109      4305.1
           42  |   6160.761   2266.232     2.72   0.007     1718.635    10602.89
           43  |   1814.442   1228.552     1.48   0.140    -593.6882    4222.571
           44  |   4018.743   1956.783     2.05   0.040     183.1799    7854.306
           45  |   3996.998   1843.268     2.17   0.030     383.9392    7610.057
           46  |   7537.238   2252.061     3.35   0.001      3122.89    11951.59
           47  |    7562.94     1881.8     4.02   0.000     3874.353    11251.53
           51  |   5467.244   1645.515     3.32   0.001     2241.807     8692.68
           52  |   5478.244   1661.695     3.30   0.001     2221.093    8735.394
           53  |   6767.271   1319.685     5.13   0.000     4180.507    9354.034
           54  |   7327.906   2332.157     3.14   0.002     2756.559    11899.25
           55  |   461.9093   1206.631     0.38   0.702    -1903.252    2827.071
           56  |   5944.212   1125.126     5.28   0.000     3738.811    8149.614
           57  |   6714.198   1368.078     4.91   0.000     4032.576    9395.819
           58  |   5953.422    1371.04     4.34   0.000     3265.995    8640.849
           59  |   5668.812   1072.401     5.29   0.000      3566.76    7770.865
           61  |   1394.769   1250.812     1.12   0.265    -1056.994    3846.532
           62  |   5017.279   2599.651     1.93   0.054     -78.3946    10112.95
           63  |   2924.687    1428.33     2.05   0.041     124.9644    5724.409
           64  |   3308.068   1121.438     2.95   0.003     1109.896     5506.24
           71  |    2687.99   1516.534     1.77   0.076    -284.6254    5660.605
           72  |   1347.843   1195.588     1.13   0.260    -995.6733    3691.359
           73  |   1726.235   1299.243     1.33   0.184    -820.4597    4272.929
           74  |   5232.073   1035.118     5.05   0.000       3203.1    7261.046
           81  |   824.4367   1289.424     0.64   0.523    -1703.011    3351.885
           82  |   6238.345   1734.605     3.60   0.000     2838.281    9638.408
           83  |   386.5133   1628.686     0.24   0.812    -2805.935    3578.962
           84  |    6439.54   1822.598     3.53   0.000     2866.998    10012.08
           85  |   1589.884   1093.809     1.45   0.146    -554.1316      3733.9
           86  |   5773.513   1361.728     4.24   0.000     3104.338    8442.687
           87  |   10595.05   2648.905     4.00   0.000     5402.832    15787.27
           88  |   10956.18   1744.709     6.28   0.000     7536.314    14376.05
           91  |   4029.553   2305.817     1.75   0.081    -490.1642     8549.27
           92  |   5112.367   1630.572     3.14   0.002     1916.223    8308.512
           93  |   8068.421   1066.071     7.57   0.000     5978.774    10158.07
           94  |     8707.7    3324.45     2.62   0.009     2191.322    15224.08
           95  |   17259.58   4262.421     4.05   0.000     8904.645    25614.51
               |
          year |
         1992  |  -610.3586    448.834    -1.36   0.174    -1490.135    269.4176
         1993  |  -984.6503   443.5714    -2.22   0.026    -1854.111   -115.1895
         1994  |  -1051.685   601.1262    -1.75   0.080    -2229.975    126.6044
         1995  |   .4091846   692.8145     0.00   1.000    -1357.602    1358.421
         1996  |          0  (omitted)
               |
         _cons |   8576.592   992.2472     8.64   0.000     6631.651    10521.53
--------------------------------------------------------------------------------

. 
. **-Coeficiente de post_treatment -> 1612.131 pvalue de 0.0089
. **-Coeficiente de constante -> 8576.592 , pvalue de 0.000
. **-r2:  0.0438  
. 
. *Rpta: Aumentó el R cuadrado cuando se aplican los fixes effects de state y year
. 
. *****************************************************
. *6) Using the specification from (v), re-estimate this model including urate  nonwhite age ed unearn, as well as state and year FEs as controls. Do you get similar estimated treatment 
> effects compared to (v)?
. 
. global controls_model "urate nonwhite age ed unearn state i.year i.state"

. reg earn post93 anykids post_treatment i.state i.year $controls_model, robust
note: 1996.year omitted because of collinearity
note: state omitted because of collinearity

Linear regression                               Number of obs     =     13,746
                                                F(62, 13683)      =      12.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0481
                                                Root MSE          =      17798

--------------------------------------------------------------------------------
               |               Robust
          earn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        post93 |  -109.6878   840.9145    -0.13   0.896    -1757.996     1538.62
       anykids |  -6224.671    425.454   -14.63   0.000    -7058.619   -5390.723
post_treatment |   1661.812   668.7613     2.48   0.013     350.9478    2972.676
               |
         state |
           12  |   4699.569    1650.51     2.85   0.004     1464.343    7934.795
           13  |   2763.505   2013.347     1.37   0.170     -1182.93    6709.941
           14  |   7371.382   1577.408     4.67   0.000     4279.445    10463.32
           15  |   9158.799   1888.083     4.85   0.000     5457.897     12859.7
           16  |   6457.575   1556.803     4.15   0.000     3406.028    9509.122
           21  |   6217.567    1052.48     5.91   0.000     4154.561    8280.573
           22  |   10478.42   1322.122     7.93   0.000     7886.879    13069.96
           23  |     5335.9   1198.893     4.45   0.000     2985.905    7685.895
           31  |   3978.791   1134.283     3.51   0.000     1755.441    6202.141
           32  |   9071.666    1809.36     5.01   0.000     5525.072    12618.26
           33  |   9141.635   1277.751     7.15   0.000     6637.069     11646.2
           34  |   7759.131   1372.019     5.66   0.000     5069.786    10448.48
           35  |   4405.084   1493.657     2.95   0.003     1477.311    7332.857
           41  |   2078.671   1626.479     1.28   0.201     -1109.45    5266.793
           42  |   6065.065   2402.248     2.52   0.012     1356.328     10773.8
           43  |   2254.947   1286.749     1.75   0.080    -267.2586    4777.152
           44  |   3699.284   2123.393     1.74   0.082    -462.8575    7861.426
           45  |   3768.953    2211.31     1.70   0.088    -565.5191    8103.424
           46  |    7987.89   2563.326     3.12   0.002     2963.419    13012.36
           47  |   7685.177   1988.488     3.86   0.000     3787.468    11582.89
           51  |   6226.463   1696.869     3.67   0.000     2900.366     9552.56
           52  |   6810.465   1714.264     3.97   0.000     3450.272    10170.66
           53  |   9012.313   1461.264     6.17   0.000     6148.034    11876.59
           54  |   8154.171   2408.351     3.39   0.001     3433.472    12874.87
           55  |   389.9827    1467.86     0.27   0.790    -2487.224     3267.19
           56  |   6686.512    1258.42     5.31   0.000     4219.835    9153.188
           57  |   7986.656   1390.993     5.74   0.000     5260.118    10713.19
           58  |   7242.601   1438.969     5.03   0.000     4422.023    10063.18
           59  |   7172.865   1096.782     6.54   0.000     5023.023    9322.708
           61  |   1444.778   1259.885     1.15   0.252    -1024.771    3914.326
           62  |   5714.302   2630.213     2.17   0.030     558.7227    10869.88
           63  |   4041.375   1442.587     2.80   0.005     1213.706    6869.044
           64  |   4804.374   1144.437     4.20   0.000      2561.12    7047.628
           71  |   3397.977   1533.373     2.22   0.027     392.3545      6403.6
           72  |   2977.335   1238.416     2.40   0.016     549.8693      5404.8
           73  |   1787.832   1348.943     1.33   0.185    -856.2825    4431.947
           74  |   7098.054   1075.636     6.60   0.000     4989.659    9206.449
           81  |   704.6778   1321.203     0.53   0.594    -1885.062    3294.418
           82  |   6605.486   1798.868     3.67   0.000     3079.458    10131.51
           83  |     629.53   1706.264     0.37   0.712    -2714.982    3974.042
           84  |   7607.486   1925.149     3.95   0.000     3833.929    11381.04
           85  |   3287.186   1130.567     2.91   0.004      1071.12    5503.252
           86  |   7096.629   1392.692     5.10   0.000     4366.761    9826.496
           87  |   11284.79   2741.604     4.12   0.000     5910.869    16658.71
           88  |   11834.44   1783.241     6.64   0.000     8339.039    15329.83
           91  |    4272.32   2298.606     1.86   0.063    -233.2633    8777.904
           92  |    5482.34   1629.881     3.36   0.001      2287.55     8677.13
           93  |    10160.6   1208.241     8.41   0.000     7792.282    12528.92
           94  |   8924.092   3335.252     2.68   0.007     2386.541    15461.64
           95  |   16985.21   4378.383     3.88   0.000     8402.977    25567.44
               |
          year |
         1992  |  -572.2299   488.0482    -1.17   0.241    -1528.871    384.4116
         1993  |  -964.5271    442.021    -2.18   0.029    -1830.949   -98.10518
         1994  |  -1021.318   595.4494    -1.72   0.086     -2188.48    145.8449
         1995  |   49.02863   681.5911     0.07   0.943    -1286.984    1385.041
         1996  |          0  (omitted)
               |
         urate |   -44.8069   305.8931    -0.15   0.884    -644.3993    554.7855
      nonwhite |  -2575.016   410.0227    -6.28   0.000    -3378.717   -1771.316
           age |   33.59626   20.34446     1.65   0.099    -6.281676     73.4742
            ed |   119.9487   67.53489     1.78   0.076    -12.42895    252.3264
        unearn |  -42.70921   86.34949    -0.49   0.621    -211.9661    126.5477
         state |          0  (omitted)
         _cons |    6843.79   2628.866     2.60   0.009     1690.851    11996.73
--------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. generate un_hijo= 0 

. replace un_hijo = 1 if children==1
(3,058 real changes made)

. gen dos_mas= 0 

. replace dos_mas = 1 if children>=2
(4,761 real changes made)

. gen post_treatment2=un_hijo*post93

. gen post_treatment3=dos_mas*post93

. reg earn un_hijo dos_mas post93 post_treatment2 post_treatment3 $controls_model, robust
note: 1996.year omitted because of collinearity
note: 95.state omitted because of collinearity

Linear regression                               Number of obs     =     13,746
                                                F(64, 13681)      =      14.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0522
                                                Root MSE          =      17760

---------------------------------------------------------------------------------
                |               Robust
           earn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        un_hijo |  -4897.371   490.6077    -9.98   0.000     -5859.03   -3935.713
        dos_mas |  -7207.288   469.7717   -15.34   0.000    -8128.105   -6286.471
         post93 |  -142.8826   840.7598    -0.17   0.865    -1790.887    1505.122
post_treatment2 |   2699.664   870.5026     3.10   0.002     993.3595    4405.969
post_treatment3 |   953.5636   681.3186     1.40   0.162    -381.9145    2289.042
          urate |  -65.41344   305.7439    -0.21   0.831    -664.7135    533.8866
       nonwhite |  -2350.556   411.8935    -5.71   0.000    -3157.924   -1543.189
            age |   24.59051   20.61033     1.19   0.233    -15.80857    64.98958
             ed |   119.9982   67.34875     1.78   0.075    -12.01466     252.011
         unearn |  -29.65414   86.69661    -0.34   0.732    -199.5914    140.2831
          state |   205.9447   52.37214     3.93   0.000     103.2881    308.6012
                |
           year |
          1992  |  -540.6394   487.2144    -1.11   0.267    -1495.646    414.3677
          1993  |  -945.7808   441.3086    -2.14   0.032    -1810.806   -80.75541
          1994  |  -978.1754   593.3332    -1.65   0.099     -2141.19    184.8392
          1995  |   64.07632   679.9752     0.09   0.925    -1268.769    1396.921
          1996  |          0  (omitted)
                |
          state |
            12  |   4616.597   1661.778     2.78   0.005     1359.285     7873.91
            13  |   2681.054   2000.564     1.34   0.180    -1240.325    6602.433
            14  |   6915.396   1574.643     4.39   0.000     3828.879    10001.91
            15  |   8397.665   1878.338     4.47   0.000     4715.865    12079.46
            16  |   5595.455    1541.53     3.63   0.000     2573.845    8617.065
            21  |   4271.969   1104.722     3.87   0.000     2106.562    6437.376
            22  |   8287.682   1375.381     6.03   0.000     5591.747    10983.62
            23  |   2856.536   1251.287     2.28   0.022     403.8404    5309.231
            31  |   131.4735   1358.747     0.10   0.923    -2531.858    2794.805
            32  |   4836.908   1953.079     2.48   0.013     1008.604    8665.212
            33  |   4739.075   1569.582     3.02   0.003     1662.478    7815.672
            34  |   3204.595   1718.729     1.86   0.062    -164.3504    6573.541
            35  |  -425.1096   1700.525    -0.25   0.803    -3758.372    2908.153
            41  |  -3986.126   1984.628    -2.01   0.045    -7876.269   -95.98273
            42  |  -243.1642   2667.559    -0.09   0.927    -5471.946    4985.617
            43  |  -4445.406   1872.109    -2.37   0.018    -8114.997   -775.8144
            44  |  -3103.672    2441.68    -1.27   0.204      -7889.7    1682.356
            45  |  -3221.092    2508.74    -1.28   0.199    -8138.567    1696.382
            46  |   1067.026   2878.327     0.37   0.711     -4574.89    6708.943
            47  |    282.431   2468.583     0.11   0.909    -4556.331    5121.193
            51  |  -2189.481   2441.215    -0.90   0.370    -6974.598    2595.635
            52  |  -1479.333   2532.432    -0.58   0.559    -6443.247    3484.581
            53  |   357.9807   2592.583     0.14   0.890    -4723.839      5439.8
            54  |  -692.3824   3067.098    -0.23   0.821    -6704.315     5319.55
            55  |  -8455.552    2749.84    -3.07   0.002    -13845.62   -3065.488
            56  |   -2642.65   2362.734    -1.12   0.263    -7273.934    1988.634
            57  |  -1339.954   2573.124    -0.52   0.603    -6383.631    3703.722
            58  |  -2381.839   2592.175    -0.92   0.358    -7462.858    2699.179
            59  |  -2643.943   2556.452    -1.03   0.301     -7654.94    2367.054
            61  |  -8847.923   2681.517    -3.30   0.001    -14104.06   -3591.781
            62  |   -4585.52   3520.018    -1.30   0.193    -11485.24    2314.199
            63  |  -6583.293   2896.898    -2.27   0.023    -12261.61   -904.9743
            64  |  -5887.271   2845.972    -2.07   0.039    -11465.77   -308.7742
            71  |  -8934.139   3265.513    -2.74   0.006    -15334.99   -2533.284
            72  |  -9501.254   3298.025    -2.88   0.004    -15965.84   -3036.672
            73  |   -11077.1   3236.723    -3.42   0.001    -17421.53   -4732.681
            74  |  -5800.705    3272.27    -1.77   0.076     -12214.8    613.3934
            81  |  -13479.37    3655.36    -3.69   0.000    -20644.38   -6314.366
            82  |  -7927.029   3884.912    -2.04   0.041    -15541.99   -312.0673
            83  |  -14221.27   3834.806    -3.71   0.000    -21738.02   -6704.524
            84  |  -7421.335   3967.741    -1.87   0.061    -15198.65     355.982
            85  |  -11710.99   3893.581    -3.01   0.003    -19342.94   -4079.032
            86  |   -8161.74   3937.661    -2.07   0.038     -15880.1   -443.3832
            87  |  -4087.143   4509.166    -0.91   0.365    -12925.73    4751.442
            88  |  -3881.526   4167.422    -0.93   0.352    -12050.25    4287.195
            91  |  -12232.73   4607.716    -2.65   0.008    -21264.49   -3200.976
            92  |  -11198.76   4320.713    -2.59   0.010    -19667.95   -2729.572
            93  |  -6651.491   4390.333    -1.52   0.130    -15257.15    1954.165
            94  |  -8305.714    5396.33    -1.54   0.124    -18883.26    2271.834
            95  |          0  (omitted)
                |
          _cons |   4791.192   2841.226     1.69   0.092    -778.0017    10360.39
---------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD8c98_000000.tmp"

. preserve

. keep if year <= 1993
(6,345 observations deleted)

. gen post91 = (year>=1992)

. gen post_treatment4= anykids*post91

. reg earn anykids post91 post_treatment4 $controls_model, robust
note: 1993.year omitted because of collinearity
note: 95.state omitted because of collinearity

Linear regression                               Number of obs     =      7,401
                                                F(59, 7341)       =      10.42
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0727
                                                Root MSE          =      15568

---------------------------------------------------------------------------------
                |               Robust
           earn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        anykids |  -6645.599   700.9915    -9.48   0.000    -8019.744   -5271.454
         post91 |  -1462.309   739.8923    -1.98   0.048    -2912.711   -11.90794
post_treatment4 |   942.4213    819.151     1.15   0.250    -663.3498    2548.192
          urate |   -125.795   392.6147    -0.32   0.749    -895.4325    643.8425
       nonwhite |  -2679.539   465.0428    -5.76   0.000    -3591.156   -1767.921
            age |   71.70357   23.02829     3.11   0.002     26.56151    116.8456
             ed |   118.1306   79.22622     1.49   0.136    -37.17554    273.4368
         unearn |  -95.50713   52.34644    -1.82   0.068    -198.1212    7.106929
          state |   144.7345   63.87831     2.27   0.023     19.51467    269.9543
                |
           year |
          1992  |   385.4811   483.3089     0.80   0.425     -561.943    1332.905
          1993  |          0  (omitted)
                |
          state |
            12  |   4246.119   1945.382     2.18   0.029     432.6116    8059.627
            13  |   2044.577   2680.021     0.76   0.446    -3209.035    7298.188
            14  |   4222.036   1530.629     2.76   0.006     1221.563    7222.509
            15  |    8922.23   2938.966     3.04   0.002     3161.013    14683.45
            16  |   5207.005   2190.731     2.38   0.017     912.5429    9501.467
            21  |   3852.998   1374.721     2.80   0.005     1158.151    6547.845
            22  |   6809.447   1650.643     4.13   0.000     3573.714    10045.18
            23  |   2741.459   1580.382     1.73   0.083    -356.5441    5839.461
            31  |   -222.633    1617.21    -0.14   0.891     -3392.83    2947.563
            32  |   3958.156   2331.988     1.70   0.090    -613.2101    8529.522
            33  |   3354.687   1910.041     1.76   0.079    -389.5422    7098.915
            34  |   3649.971   2417.939     1.51   0.131    -1089.883    8389.826
            35  |  -608.3334   1988.185    -0.31   0.760    -4505.746    3289.079
            41  |  -3342.865   2482.755    -1.35   0.178    -8209.778    1524.048
            42  |   1760.034   3795.549     0.46   0.643    -5680.333      9200.4
            43  |  -5598.068   2088.953    -2.68   0.007    -9693.015   -1503.121
            44  |  -2779.006   3086.901    -0.90   0.368    -8830.218    3272.206
            45  |  -3483.276   2778.583    -1.25   0.210    -8930.096    1963.544
            46  |  -1689.352   3224.873    -0.52   0.600     -8011.03    4632.325
            47  |   1224.415   2921.826     0.42   0.675    -4503.203    6952.033
            51  |   553.5305   2941.701     0.19   0.851    -5213.048    6320.109
            52  |   -598.288   3551.819    -0.17   0.866    -7560.872    6364.296
            53  |   747.5675   3081.674     0.24   0.808    -5293.398    6788.533
            54  |  -1819.425   2968.302    -0.61   0.540    -7638.149    3999.298
            55  |  -7264.659   3650.358    -1.99   0.047    -14420.41    -108.908
            56  |  -1816.746   2802.311    -0.65   0.517    -7310.081    3676.589
            57  |   -746.187   3157.692    -0.24   0.813    -6936.171    5443.797
            58  |  -2842.828   3199.678    -0.89   0.374    -9115.116     3429.46
            59  |  -583.1019   3146.274    -0.19   0.853    -6750.702    5584.498
            61  |  -8308.992   3234.496    -2.57   0.010    -14649.53   -1968.452
            62  |  -6427.426   3216.665    -2.00   0.046    -12733.01   -121.8394
            63  |  -2446.233   3810.219    -0.64   0.521    -9915.356    5022.891
            64  |  -5049.362   3483.754    -1.45   0.147    -11878.52    1779.796
            71  |  -8525.169   3796.788    -2.25   0.025    -15967.96   -1082.374
            72  |  -6623.401   4043.153    -1.64   0.101    -14549.14     1302.34
            73  |  -8446.449   3964.856    -2.13   0.033    -16218.71   -674.1921
            74  |  -4114.497   3957.067    -1.04   0.298    -11871.48     3642.49
            81  |   -10640.1   4453.125    -2.39   0.017     -19369.5   -1910.692
            82  |  -3796.912   4806.182    -0.79   0.430    -13218.41    5624.586
            83  |  -12124.45   4502.481    -2.69   0.007     -20950.6   -3298.289
            84  |  -3534.764   4836.942    -0.73   0.465    -13016.56    5947.032
            85  |  -8624.784   4724.799    -1.83   0.068    -17886.75    637.1787
            86  |  -4958.947   4821.898    -1.03   0.304    -14411.25    4493.358
            87  |  -5912.053   4983.984    -1.19   0.236    -15682.09    3857.986
            88  |   514.7326   5118.269     0.10   0.920    -9518.544    10548.01
            91  |  -6687.817    5982.53    -1.12   0.264    -18415.29     5039.66
            92  |  -9608.193   5167.816    -1.86   0.063     -19738.6    522.2105
            93  |  -2780.799   5378.562    -0.52   0.605    -13324.32    7762.727
            94  |  -3542.391   6946.373    -0.51   0.610    -17159.28    10074.49
            95  |          0  (omitted)
                |
          _cons |       6605   3779.774     1.75   0.081    -804.4435    14014.44
---------------------------------------------------------------------------------

. 
. restore

. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\Lorena\Documents\curso python-ML-EC\ECO\dif dif pc\preg2.log
  log type:  text
 closed on:  11 Feb 2024, 23:49:46
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
