--------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Lorena\Documents\curso python-ML-EC\ECO\Materi
> al_clase_VI_QLab2024\Material_clase_2024\Data\rep_results.log
  log type:  text
 opened on:  28 Jan 2024, 16:04:48

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. use "mss_repdata (1).dta",clear
(Miguel, Satyanath, Sergenti 2004, Civil Conflict)

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. global x_fl = "y_0 polity2l ethfrac relfrac Oil lpopl1 lmtnest"

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. global x_year = "Iccyear*"

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. tab ccode, gen(Iccode)  

COW Country |
       Code |      Freq.     Percent        Cum.
------------+-----------------------------------
        404 |         19        2.56        2.56
        420 |         19        2.56        5.11
        432 |         19        2.56        7.67
        433 |         19        2.56       10.23
        434 |         19        2.56       12.79
        435 |         19        2.56       15.34
        436 |         19        2.56       17.90
        437 |         19        2.56       20.46
        438 |         19        2.56       23.01
        439 |         19        2.56       25.57
        450 |         11        1.48       27.05
        451 |         19        2.56       29.61
        452 |         19        2.56       32.17
        461 |         19        2.56       34.72
        471 |         19        2.56       37.28
        475 |         19        2.56       39.84
        481 |         19        2.56       42.40
        482 |         19        2.56       44.95
        483 |         19        2.56       47.51
        484 |         19        2.56       50.07
        490 |         18        2.42       52.49
        500 |         19        2.56       55.05
        501 |         19        2.56       57.60
        510 |         19        2.56       60.16
        516 |         19        2.56       62.72
        517 |         19        2.56       65.28
        520 |         11        1.48       66.76
        522 |         11        1.48       68.24
        530 |         19        2.56       70.79
        540 |         19        2.56       73.35
        541 |         19        2.56       75.91
        551 |         19        2.56       78.47
        552 |         19        2.56       81.02
        553 |         19        2.56       83.58
        560 |         19        2.56       86.14
        565 |          9        1.21       87.35
        570 |         19        2.56       89.91
        571 |         19        2.56       92.46
        572 |         19        2.56       95.02
        580 |         19        2.56       97.58
        625 |         18        2.42      100.00
------------+-----------------------------------
      Total |        743      100.00

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. rename year year_actual

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. gen year = year_actual - 1978

. label variable year "Year Trend"

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. local i=1

. while (`i'< 42) {
  2. gen Iccyear`i' = Iccode`i'*year
  3. label variable Iccyear`i' "Country-Specific Time Trend for Iccode`i'"
  4. local i = `i' + 1
  5. }

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. summ any_prio any_prio_on any_prio_off war_prio war_prio_on war_prio_off war_col war_inc war

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    any_prio |        743    .2678331    .4431284          0          1
 any_prio_on |        555    .0684685    .2527759          0          1
any_prio_off |        188     .143617    .3516374          0          1
    war_prio |        743     .166891    .3731297          0          1
 war_prio_on |        625       .0368    .1884212          0          1
-------------+---------------------------------------------------------
war_prio_off |        118    .1440678    .3526559          0          1
     war_col |        743    .1695828    .3755186          0          1
     war_inc |        724    .2209945    .4152036          0          1
         war |        743    .2449529     .430349          0          1

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. summ any_prio any_prio_on any_prio_off war_prio war_prio_on war_prio_off war_col war_inc war

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    any_prio |        743    .2678331    .4431284          0          1
 any_prio_on |        555    .0684685    .2527759          0          1
any_prio_off |        188     .143617    .3516374          0          1
    war_prio |        743     .166891    .3731297          0          1
 war_prio_on |        625       .0368    .1884212          0          1
-------------+---------------------------------------------------------
war_prio_off |        118    .1440678    .3526559          0          1
     war_col |        743    .1695828    .3755186          0          1
     war_inc |        724    .2209945    .4152036          0          1
         war |        743    .2449529     .430349          0          1

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. summ GPCP GPCP_g GPCP_g_l

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        GPCP |        743    1001.639    501.7016   96.10933   2587.637
      GPCP_g |        743    .0181953    .2094129  -.5498713   1.676976
    GPCP_g_l |        743    .0112713    .2066666  -.5498713   1.676976

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. summ gdp_g gdp_g_l

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       gdp_g |        743   -.0047543     .070698  -.4739726   .6704121
     gdp_g_l |        743   -.0055523     .072391  -.4739726   .6704121

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. regress gdp_g GPCP_g GPCP_g_l, robust cluster(ccode)

Linear regression                               Number of obs     =        743
                                                F(2, 40)          =       6.67
                                                Prob > F          =     0.0032
                                                R-squared         =     0.0235
                                                Root MSE          =     .06996

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
       gdp_g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |   .0554296   .0163015     3.40   0.002     .0224831    .0883761
    GPCP_g_l |   .0340581   .0132131     2.58   0.014     .0073535    .0607628
       _cons |  -.0061467   .0024601    -2.50   0.017    -.0111188   -.0011747
------------------------------------------------------------------------------

. 
.                 * solo con lluvias
.                 
. regress gdp_g GPCP_g GPCP_g_l $x_fl $x_year, robust cluster(ccode)

Linear regression                               Number of obs     =        743
                                                F(9, 40)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0806
                                                Root MSE          =      .0702

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
       gdp_g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |   .0530456     .01682     3.15   0.003     .0190512      .08704
    GPCP_g_l |    .032021   .0135053     2.37   0.023     .0047256    .0593163
         y_0 |  -.0108676   .0069111    -1.57   0.124    -.0248354    .0031003
    polity2l |   .0000283   .0006883     0.04   0.967    -.0013627    .0014194
     ethfrac |   .0057144   .0439273     0.13   0.897    -.0830659    .0944947
     relfrac |   .0453882   .0442037     1.03   0.311    -.0439509    .1347272
         Oil |   .0066899   .0188867     0.35   0.725    -.0314814    .0448613
      lpopl1 |  -.0086935   .0086725    -1.00   0.322    -.0262212    .0088343
     lmtnest |   .0008185   .0053673     0.15   0.880    -.0100293    .0116663
    Iccyear1 |  -.0012351   .0015826    -0.78   0.440    -.0044338    .0019635
    Iccyear2 |   .0006543   .0013291     0.49   0.625    -.0020319    .0033405
    Iccyear3 |   .0022103   .0009727     2.27   0.029     .0002443    .0041762
    Iccyear4 |   .0027163   .0009998     2.72   0.010     .0006957    .0047369
    Iccyear5 |   .0014773   .0008013     1.84   0.073    -.0001422    .0030968
    Iccyear6 |   .0024514    .001332     1.84   0.073    -.0002408    .0051435
    Iccyear7 |  -.0001729   .0006943    -0.25   0.805    -.0015762    .0012303
    Iccyear8 |   .0013391   .0009463     1.42   0.165    -.0005734    .0032516
    Iccyear9 |   .0021535   .0008327     2.59   0.013     .0004705    .0038365
   Iccyear10 |   .0014154   .0009762     1.45   0.155    -.0005575    .0033884
   Iccyear11 |  -.0023972   .0018894    -1.27   0.212    -.0062158    .0014215
   Iccyear12 |  -.0026507   .0006875    -3.86   0.000    -.0040402   -.0012612
   Iccyear13 |   .0020841   .0012834     1.62   0.112    -.0005096    .0046779
   Iccyear14 |  -.0000537    .000754    -0.07   0.944    -.0015776    .0014702
   Iccyear15 |  -.0002937   .0008168    -0.36   0.721    -.0019446    .0013571
   Iccyear16 |   .0012835   .0017427     0.74   0.466    -.0022387    .0048057
   Iccyear17 |    .002157   .0014907     1.45   0.156    -.0008559    .0051698
   Iccyear18 |  -.0008988   .0013694    -0.66   0.515    -.0036664    .0018688
   Iccyear19 |  -.0004195   .0010501    -0.40   0.692    -.0025418    .0017028
   Iccyear20 |  -.0009014   .0014732    -0.61   0.544    -.0038789     .002076
   Iccyear21 |  -.0028817   .0010697    -2.69   0.010    -.0050436   -.0007198
   Iccyear22 |   .0021605   .0010607     2.04   0.048     .0000166    .0043043
   Iccyear23 |   .0010812   .0011071     0.98   0.335    -.0011563    .0033186
   Iccyear24 |   .0016217   .0011248     1.44   0.157    -.0006516    .0038951
   Iccyear25 |  -.0007957   .0014776    -0.54   0.593    -.0037819    .0021906
   Iccyear26 |   .0010468   .0012882     0.81   0.421    -.0015567    .0036503
   Iccyear27 |   .0020408    .002995     0.68   0.500    -.0040124     .008094
   Iccyear28 |   .0030838   .0029222     1.06   0.298    -.0028221    .0089898
   Iccyear29 |    .002069   .0012949     1.60   0.118    -.0005481    .0046861
   Iccyear30 |  -.0007622   .0011114    -0.69   0.497    -.0030084     .001484
   Iccyear31 |   .0027608    .000966     2.86   0.007     .0008085    .0047132
   Iccyear32 |  -.0002047   .0006873    -0.30   0.767    -.0015937    .0011843
   Iccyear33 |   .0016558   .0007978     2.08   0.044     .0000434    .0032682
   Iccyear34 |   .0009882   .0007761     1.27   0.210    -.0005803    .0025568
   Iccyear35 |   .0034844   .0021697     1.61   0.116    -.0009008    .0078696
   Iccyear36 |   .0011772     .00136     0.87   0.392    -.0015713    .0039258
   Iccyear37 |   .0011304   .0012156     0.93   0.358    -.0013264    .0035871
   Iccyear38 |   .0019186   .0011049     1.74   0.090    -.0003145    .0041518
   Iccyear39 |   .0013932    .001007     1.38   0.174     -.000642    .0034284
   Iccyear40 |   .0002569   .0018168     0.14   0.888    -.0034149    .0039288
   Iccyear41 |   .0037287   .0009184     4.06   0.000     .0018726    .0055848
       _cons |   .0438521   .0641231     0.68   0.498    -.0857454    .1734496
------------------------------------------------------------------------------

.                 *mas exogenas
.                 
. regress gdp_g GPCP_g GPCP_g_l Iccode* $x_year, robust cluster(ccode) 
note: Iccode36 omitted because of collinearity

Linear regression                               Number of obs     =        743
                                                F(1, 40)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1326
                                                Root MSE          =     .06987

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
       gdp_g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |   .0485818   .0170171     2.85   0.007     .0141889    .0829747
    GPCP_g_l |   .0280038    .014191     1.97   0.055    -.0006772    .0566849
     Iccode1 |   .1746899   .0084575    20.65   0.000     .1575966    .1917832
     Iccode2 |   .0222165   .0086765     2.56   0.014     .0046807    .0397523
     Iccode3 |   .0681341   .0107734     6.32   0.000     .0463603     .089908
     Iccode4 |   .0700139    .008912     7.86   0.000      .052002    .0880258
     Iccode5 |   .0475224   .0096467     4.93   0.000     .0280257    .0670191
     Iccode6 |   .0644878   .0110526     5.83   0.000     .0421497    .0868259
     Iccode7 |    .031038     .01233     2.52   0.016     .0061181    .0559579
     Iccode8 |   .0210035   .0096031     2.19   0.035     .0015949    .0404121
     Iccode9 |   .0485452   .0092415     5.25   0.000     .0298675    .0672229
    Iccode10 |     .09027   .0096649     9.34   0.000     .0707365    .1098036
    Iccode11 |   .0911438     .00953     9.56   0.000      .071883    .1104046
    Iccode12 |    .074123   .0089075     8.32   0.000     .0561202    .0921257
    Iccode13 |   .0351445   .0097005     3.62   0.001     .0155392    .0547499
    Iccode14 |   .0411256   .0098051     4.19   0.000     .0213087    .0609424
    Iccode15 |   .0996331    .009603    10.38   0.000     .0802248    .1190415
    Iccode16 |   .0199124   .0100223     1.99   0.054    -.0003433    .0401681
    Iccode17 |   .0378799   .0086318     4.39   0.000     .0204345    .0553253
    Iccode18 |   .0348722   .0094415     3.69   0.001     .0157903    .0539541
    Iccode19 |   .0258291   .0109169     2.37   0.023     .0037653    .0478929
    Iccode20 |   .1540726   .0083982    18.35   0.000     .1370992    .1710459
    Iccode21 |   .0812171   .0082143     9.89   0.000     .0646154    .0978188
    Iccode22 |   .1643179   .0079819    20.59   0.000     .1481859    .1804498
    Iccode23 |   .0662205   .0096592     6.86   0.000     .0466985    .0857425
    Iccode24 |   .0867558   .0096092     9.03   0.000     .0673349    .1061766
    Iccode25 |   .1177617   .0086451    13.62   0.000     .1002893     .135234
    Iccode26 |   .0652378   .0085065     7.67   0.000     .0480456      .08243
    Iccode27 |   .1277013   .0064419    19.82   0.000     .1146818    .1407208
    Iccode28 |  -.0448697   .0068082    -6.59   0.000    -.0586296   -.0311099
    Iccode29 |   .0636976   .0090463     7.04   0.000     .0454144    .0819808
    Iccode30 |   .0735516   .0090406     8.14   0.000     .0552799    .0918233
    Iccode31 |   .0144311    .009671     1.49   0.143    -.0051148    .0339769
    Iccode32 |   .0404434   .0097795     4.14   0.000     .0206782    .0602085
    Iccode33 |   .0773645   .0093365     8.29   0.000     .0584948    .0962342
    Iccode34 |   .0514663   .0100167     5.14   0.000     .0312217    .0717108
    Iccode35 |   .0672818   .0090551     7.43   0.000     .0489807    .0855829
    Iccode36 |          0  (omitted)
    Iccode37 |   .0710293   .0086404     8.22   0.000     .0535664    .0884923
    Iccode38 |   .1031242   .0090979    11.33   0.000     .0847365    .1215118
    Iccode39 |   .0467184   .0086553     5.40   0.000     .0292253    .0642115
    Iccode40 |   .0056923   .0089199     0.64   0.527    -.0123354      .02372
    Iccode41 |   .0337568   .0093357     3.62   0.001     .0148886     .052625
    Iccyear1 |  -.0074002   .0000444  -166.54   0.000      -.00749   -.0073104
    Iccyear2 |    .003528   .0000356    99.13   0.000     .0034561    .0035999
    Iccyear3 |   .0009833   .0001607     6.12   0.000     .0006586     .001308
    Iccyear4 |   .0008353   .0000176    47.51   0.000     .0007998    .0008708
    Iccyear5 |   .0024428   .0000439    55.68   0.000     .0023541    .0025315
    Iccyear6 |   .0012848   .0001924     6.68   0.000     .0008959    .0016736
    Iccyear7 |   .0015698   .0003331     4.71   0.000     .0008966    .0022431
    Iccyear8 |    .003093   1.52e-06  2038.60   0.000     .0030899     .003096
    Iccyear9 |   .0026389   .0000417    63.22   0.000     .0025546    .0027233
   Iccyear10 |  -.0001261   .0000491    -2.57   0.014    -.0002253   -.0000269
   Iccyear11 |  -.0038331   .0000668   -57.42   0.000     -.003968   -.0036981
   Iccyear12 |   -.003215   .0001062   -30.28   0.000    -.0034296   -.0030003
   Iccyear13 |   .0040625   .0000577    70.41   0.000     .0039458    .0041791
   Iccyear14 |   .0018071   .0000467    38.67   0.000     .0017126    .0019015
   Iccyear15 |  -.0024554   .0000385   -63.71   0.000    -.0025333   -.0023775
   Iccyear16 |   .0030647   .0000591    51.87   0.000     .0029453    .0031841
   Iccyear17 |   .0023009   .0000551    41.74   0.000     .0021895    .0024123
   Iccyear18 |   .0025722   .0000183   140.86   0.000     .0025353    .0026091
   Iccyear19 |   .0029958   .0001954    15.33   0.000     .0026009    .0033907
   Iccyear20 |  -.0067053   .0000702   -95.54   0.000    -.0068471   -.0065634
   Iccyear21 |   -.004259   .0001304   -32.65   0.000    -.0045226   -.0039953
   Iccyear22 |  -.0042837   .0001119   -38.28   0.000    -.0045099   -.0040576
   Iccyear23 |   .0008983   .0000923     9.73   0.000     .0007117    .0010848
   Iccyear24 |   .0000661   9.48e-06     6.98   0.000      .000047    .0000853
   Iccyear25 |  -.0040745    .000079   -51.57   0.000    -.0042342   -.0039149
   Iccyear26 |   .0010065   .0000906    11.10   0.000     .0008233    .0011897
   Iccyear27 |  -.0076551   .0007994    -9.58   0.000    -.0092707   -.0060395
   Iccyear28 |    .014763   .0005027    29.37   0.000      .013747     .015779
   Iccyear29 |   .0017769   .0000243    73.21   0.000     .0017278    .0018259
   Iccyear30 |  -.0006285   .0000398   -15.80   0.000    -.0007089   -.0005481
   Iccyear31 |    .005876   .0000914    64.31   0.000     .0056913    .0060606
   Iccyear32 |   .0010656   .0000201    52.89   0.000     .0010249    .0011064
   Iccyear33 |   .0002249    .000065     3.46   0.001     .0000935    .0003563
   Iccyear34 |   .0023082   .0001252    18.43   0.000     .0020551    .0025613
   Iccyear35 |   .0003638    .000025    14.57   0.000     .0003133    .0004143
   Iccyear36 |   .0038211   .0003834     9.97   0.000     .0030461    .0045961
   Iccyear37 |   .0007762   .0000616    12.60   0.000     .0006517    .0009007
   Iccyear38 |  -.0005762   .0000484   -11.90   0.000     -.000674   -.0004784
   Iccyear39 |   .0019869   .0000179   111.22   0.000     .0019508     .002023
   Iccyear40 |     .00387   .0000596    64.95   0.000     .0037495    .0039904
   Iccyear41 |   .0049638   .0000118   421.93   0.000       .00494    .0049876
       _cons |  -.0782222   .0095133    -8.22   0.000    -.0974492   -.0589952
------------------------------------------------------------------------------

. regress gdp_g GPCP_g GPCP_g_l GPCP_g_fl Iccode* $x_year, robust cluster(ccode) 
note: Iccode36 omitted because of collinearity

Linear regression                               Number of obs     =        743
                                                F(2, 40)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1326
                                                Root MSE          =     .06992

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
       gdp_g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |   .0489444   .0183716     2.66   0.011     .0118141    .0860748
    GPCP_g_l |   .0282352   .0141958     1.99   0.054    -.0004556     .056926
   GPCP_g_fl |   .0006168   .0190552     0.03   0.974    -.0378952    .0391287
     Iccode1 |   .1749614   .0101742    17.20   0.000     .1543985    .1955243
     Iccode2 |   .0224965   .0104756     2.15   0.038     .0013244    .0436685
     Iccode3 |   .0684706   .0127539     5.37   0.000     .0426941    .0942472
     Iccode4 |   .0703033   .0107849     6.52   0.000     .0485061    .0921004
     Iccode5 |   .0477932   .0109216     4.38   0.000     .0257199    .0698665
     Iccode6 |   .0648635   .0136533     4.75   0.000     .0372692    .0924579
     Iccode7 |   .0314043   .0142564     2.20   0.033     .0025909    .0602176
     Iccode8 |   .0212974   .0112792     1.89   0.066    -.0014986    .0440935
     Iccode9 |   .0488442     .01116     4.38   0.000     .0262891    .0713994
    Iccode10 |   .0905452   .0109995     8.23   0.000     .0683143    .1127761
    Iccode11 |   .0914594   .0116458     7.85   0.000     .0679224    .1149964
    Iccode12 |   .0744164   .0108696     6.85   0.000     .0524482    .0963847
    Iccode13 |   .0354445   .0114352     3.10   0.004     .0123331     .058556
    Iccode14 |   .0414151   .0113244     3.66   0.001     .0185278    .0643025
    Iccode15 |   .0999359   .0114255     8.75   0.000     .0768441    .1230278
    Iccode16 |   .0202134   .0116591     1.73   0.091    -.0033505    .0437774
    Iccode17 |   .0381666   .0105396     3.62   0.001     .0168653    .0594679
    Iccode18 |   .0351605    .011073     3.18   0.003     .0127811    .0575398
    Iccode19 |   .0261715   .0129417     2.02   0.050     .0000154    .0523276
    Iccode20 |   .1543526   .0102751    15.02   0.000     .1335858    .1751193
    Iccode21 |   .0814626    .009558     8.52   0.000     .0621453    .1007799
    Iccode22 |   .1645387   .0089986    18.28   0.000     .1463517    .1827256
    Iccode23 |   .0664813   .0108138     6.15   0.000     .0446258    .0883367
    Iccode24 |   .0870149   .0107047     8.13   0.000     .0653798      .10865
    Iccode25 |   .1180141   .0099546    11.86   0.000     .0978951     .138133
    Iccode26 |    .065476   .0096353     6.80   0.000     .0460023    .0849496
    Iccode27 |   .1277355    .006453    19.79   0.000     .1146936    .1407775
    Iccode28 |  -.0445874   .0097044    -4.59   0.000    -.0642006   -.0249741
    Iccode29 |   .0639746   .0106412     6.01   0.000     .0424679    .0854812
    Iccode30 |   .0738164   .0104118     7.09   0.000     .0527733    .0948595
    Iccode31 |   .0147617   .0119815     1.23   0.225    -.0094538    .0389771
    Iccode32 |   .0407596   .0117898     3.46   0.001     .0169316    .0645877
    Iccode33 |   .0777312   .0125614     6.19   0.000     .0523437    .1031187
    Iccode34 |   .0517594   .0115077     4.50   0.000     .0285014    .0750174
    Iccode35 |   .0676148   .0117275     5.77   0.000     .0439126    .0913171
    Iccode36 |          0  (omitted)
    Iccode37 |   .0713204   .0106883     6.67   0.000     .0497185    .0929223
    Iccode38 |   .1034835   .0122865     8.42   0.000     .0786516    .1283155
    Iccode39 |   .0470378   .0112203     4.19   0.000     .0243607     .069715
    Iccode40 |   .0059755    .010673     0.56   0.579    -.0155955    .0275464
    Iccode41 |   .0340672   .0114232     2.98   0.005     .0109801    .0571544
    Iccyear1 |     -.0074   .0000431  -171.70   0.000    -.0074871   -.0073129
    Iccyear2 |   .0035277   .0000387    91.06   0.000     .0034494     .003606
    Iccyear3 |   .0009785   .0001873     5.22   0.000     .0005999    .0013572
    Iccyear4 |   .0008344   .0000364    22.94   0.000     .0007609    .0009079
    Iccyear5 |   .0024439    .000062    39.41   0.000     .0023186    .0025692
    Iccyear6 |   .0012764   .0002791     4.57   0.000     .0007124    .0018405
    Iccyear7 |   .0015607   .0003737     4.18   0.000     .0008054    .0023161
    Iccyear8 |   .0030935   .0000162   190.84   0.000     .0030607    .0031262
    Iccyear9 |   .0026396    .000042    62.80   0.000     .0025546    .0027245
   Iccyear10 |  -.0001256   .0000551    -2.28   0.028     -.000237   -.0000142
   Iccyear11 |  -.0038336   .0000718   -53.40   0.000    -.0039787   -.0036885
   Iccyear12 |  -.0032129   .0001102   -29.16   0.000    -.0034356   -.0029902
   Iccyear13 |   .0040613   .0000631    64.37   0.000     .0039338    .0041888
   Iccyear14 |   .0018072   .0000478    37.82   0.000     .0017106    .0019038
   Iccyear15 |  -.0024562   .0000433   -56.78   0.000    -.0025436   -.0023688
   Iccyear16 |    .003064   .0000577    53.08   0.000     .0029473    .0031806
   Iccyear17 |   .0023005   .0000589    39.06   0.000     .0021814    .0024195
   Iccyear18 |   .0025728   .0000287    89.57   0.000     .0025148    .0026309
   Iccyear19 |   .0029902   .0002252    13.28   0.000     .0025351    .0034454
   Iccyear20 |  -.0067048   .0000683   -98.17   0.000    -.0068428   -.0065667
   Iccyear21 |  -.0042541   .0001697   -25.06   0.000    -.0045972   -.0039111
   Iccyear22 |  -.0042776   .0001909   -22.41   0.000    -.0046634   -.0038918
   Iccyear23 |   .0009009   .0001297     6.95   0.000     .0006387     .001163
   Iccyear24 |     .00007   .0001172     0.60   0.554    -.0001668    .0003067
   Iccyear25 |  -.0040704   .0001313   -30.99   0.000    -.0043358   -.0038049
   Iccyear26 |   .0010116   .0001605     6.30   0.000     .0006872    .0013361
   Iccyear27 |  -.0076324   .0009439    -8.09   0.000    -.0095402   -.0057247
   Iccyear28 |   .0147674   .0004881    30.25   0.000     .0137809    .0157539
   Iccyear29 |   .0017788   .0000584    30.43   0.000     .0016606    .0018969
   Iccyear30 |  -.0006266   .0000636    -9.86   0.000     -.000755   -.0004981
   Iccyear31 |   .0058712   .0001593    36.86   0.000     .0055493    .0061932
   Iccyear32 |   .0010635   .0000656    16.22   0.000      .000931     .001196
   Iccyear33 |   .0002155   .0002826     0.76   0.450    -.0003557    .0007866
   Iccyear34 |   .0023059   .0001326    17.39   0.000     .0020379    .0025739
   Iccyear35 |   .0003593   .0001423     2.53   0.016     .0000718    .0006469
   Iccyear36 |   .0038277   .0003861     9.91   0.000     .0030474     .004608
   Iccyear37 |   .0007742   .0000919     8.42   0.000     .0005885      .00096
   Iccyear38 |  -.0005865   .0003093    -1.90   0.065    -.0012116    .0000386
   Iccyear39 |   .0019821   .0001509    13.13   0.000     .0016771    .0022872
   Iccyear40 |   .0038714   .0000658    58.85   0.000     .0037385    .0040044
   Iccyear41 |   .0049613   .0000769    64.56   0.000      .004806    .0051166
       _cons |  -.0785229   .0113424    -6.92   0.000    -.1014468    -.055599
------------------------------------------------------------------------------

. regress gdp_g GPCP_g GPCP_g_l tot_100_g Iccode* $x_year, robust cluster(ccode) 
note: Iccode11 omitted because of collinearity
note: Iccode27 omitted because of collinearity
note: Iccode28 omitted because of collinearity
note: Iccode36 omitted because of collinearity
note: Iccode41 omitted because of collinearity
note: Iccyear11 omitted because of collinearity
note: Iccyear27 omitted because of collinearity
note: Iccyear28 omitted because of collinearity
note: Iccyear41 omitted because of collinearity

Linear regression                               Number of obs     =        661
                                                F(2, 36)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1616
                                                Root MSE          =     .06339

                                 (Std. Err. adjusted for 37 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
       gdp_g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |   .0531241   .0179612     2.96   0.005      .016697    .0895511
    GPCP_g_l |   .0366163   .0151514     2.42   0.021     .0058877    .0673448
   tot_100_g |  -.0022802   .0229622    -0.10   0.921    -.0488498    .0442894
     Iccode1 |    .180554   .0118339    15.26   0.000     .1565538    .2045541
     Iccode2 |   .0276614    .009286     2.98   0.005     .0088284    .0464944
     Iccode3 |   .0750013   .0121753     6.16   0.000     .0503087     .099694
     Iccode4 |   .0758848    .010613     7.15   0.000     .0543605     .097409
     Iccode5 |   .0538578   .0114447     4.71   0.000     .0306469    .0770688
     Iccode6 |   .0714922   .0123981     5.77   0.000     .0463478    .0966367
     Iccode7 |   .0387095   .0134072     2.89   0.007     .0115184    .0659006
     Iccode8 |   .0272116   .0109989     2.47   0.018     .0049049    .0495183
     Iccode9 |    .072583   .0073914     9.82   0.000     .0575925    .0875735
    Iccode10 |   .0967487   .0122397     7.90   0.000     .0719254    .1215719
    Iccode11 |          0  (omitted)
    Iccode12 |   .0799752    .010486     7.63   0.000     .0587086    .1012418
    Iccode13 |   .0411573   .0103057     3.99   0.000     .0202565    .0620582
    Iccode14 |   .0474397   .0112083     4.23   0.000     .0247082    .0701711
    Iccode15 |     .10597   .0118127     8.97   0.000     .0820127    .1299273
    Iccode16 |   .0260535   .0104731     2.49   0.018     .0048131    .0472939
    Iccode17 |   .0433468     .00955     4.54   0.000     .0239784    .0627151
    Iccode18 |   .0407782   .0113836     3.58   0.001     .0176912    .0638653
    Iccode19 |   .0255702   .0121614     2.10   0.043     .0009058    .0502346
    Iccode20 |    .159623   .0103786    15.38   0.000     .1385742    .1806717
    Iccode21 |   .1017782   .0104842     9.71   0.000     .0805152    .1230411
    Iccode22 |  -.0578267   .0120723    -4.79   0.000    -.0823104    -.033343
    Iccode23 |   .0724689   .0109199     6.64   0.000     .0503224    .0946154
    Iccode24 |   .0688708   .0113365     6.08   0.000     .0458794    .0918622
    Iccode25 |   .1234438   .0102399    12.06   0.000     .1026764    .1442111
    Iccode26 |   .0753312   .0105278     7.16   0.000     .0539797    .0966826
    Iccode27 |          0  (omitted)
    Iccode28 |          0  (omitted)
    Iccode29 |   .0694827   .0105211     6.60   0.000     .0481449    .0908205
    Iccode30 |   .0193114   .0100657     1.92   0.063    -.0011027    .0397255
    Iccode31 |   .0205784   .0109227     1.88   0.068    -.0015738    .0427306
    Iccode32 |   .0469183   .0119938     3.91   0.000     .0225938    .0712428
    Iccode33 |   .0834589   .0110286     7.57   0.000     .0610919     .105826
    Iccode34 |   .0577852   .0111854     5.17   0.000     .0351002    .0804701
    Iccode35 |   .0731325   .0102587     7.13   0.000     .0523268    .0939381
    Iccode36 |          0  (omitted)
    Iccode37 |   .0769204   .0103387     7.44   0.000     .0559525    .0978882
    Iccode38 |   .1167339   .0124428     9.38   0.000     .0914988     .141969
    Iccode39 |   .0524459   .0105256     4.98   0.000     .0310989    .0737929
    Iccode40 |   .0116209   .0108968     1.07   0.293     -.010479    .0337207
    Iccode41 |          0  (omitted)
    Iccyear1 |  -.0073965   .0002357   -31.38   0.000    -.0078746   -.0069184
    Iccyear2 |   .0035622   .0001704    20.91   0.000     .0032167    .0039078
    Iccyear3 |   .0009012   .0001628     5.53   0.000     .0005709    .0012315
    Iccyear4 |   .0008429   .0000274    30.76   0.000     .0007873    .0008984
    Iccyear5 |   .0024118   .0000648    37.23   0.000     .0022804    .0025431
    Iccyear6 |   .0011969   .0001921     6.23   0.000     .0008074    .0015865
    Iccyear7 |    .001397   .0003325     4.20   0.000     .0007226    .0020713
    Iccyear8 |   .0030932   6.66e-06   464.71   0.000     .0030797    .0031067
    Iccyear9 |    .001491   .0002174     6.86   0.000     .0010499     .001932
   Iccyear10 |  -.0001652   .0001287    -1.28   0.208    -.0004263    .0000959
   Iccyear11 |          0  (omitted)
   Iccyear12 |  -.0031749   .0001133   -28.03   0.000    -.0034046   -.0029452
   Iccyear13 |   .0040687   .0001487    27.36   0.000     .0037671    .0043702
   Iccyear14 |   .0017934    .000049    36.61   0.000      .001694    .0018927
   Iccyear15 |   -.002469   .0001114   -22.16   0.000    -.0026949    -.002243
   Iccyear16 |   .0030577   .0001951    15.67   0.000     .0026621    .0034533
   Iccyear17 |    .002331   .0000639    36.50   0.000     .0022015    .0024605
   Iccyear18 |   .0025872   .0002069    12.51   0.000     .0021676    .0030067
   Iccyear19 |   .0037164   .0001788    20.79   0.000     .0033538    .0040789
   Iccyear20 |  -.0066749   .0001334   -50.04   0.000    -.0069455   -.0064044
   Iccyear21 |  -.0060045   .0001739   -34.53   0.000    -.0063571   -.0056518
   Iccyear22 |   .0105393   .0002695    39.11   0.000     .0099928    .0110858
   Iccyear23 |   .0008685   .0001404     6.18   0.000     .0005837    .0011534
   Iccyear24 |   .0012478   .0001877     6.65   0.000     .0008672    .0016284
   Iccyear25 |  -.0040323   .0000809   -49.86   0.000    -.0041964   -.0038683
   Iccyear26 |   .0005538    .000154     3.60   0.001     .0002414    .0008662
   Iccyear27 |          0  (omitted)
   Iccyear28 |          0  (omitted)
   Iccyear29 |   .0017959   .0000738    24.35   0.000     .0016463    .0019455
   Iccyear30 |   .0031785   .0002945    10.79   0.000     .0025813    .0037757
   Iccyear31 |   .0058502    .000118    49.60   0.000      .005611    .0060894
   Iccyear32 |   .0010399   .0001842     5.64   0.000     .0006663    .0014136
   Iccyear33 |   .0001952   .0000676     2.89   0.007      .000058    .0003324
   Iccyear34 |   .0022797   .0001312    17.37   0.000     .0020136    .0025458
   Iccyear35 |   .0003696   .0000527     7.02   0.000     .0002629    .0004764
   Iccyear36 |   .0040797   .0004947     8.25   0.000     .0030763     .005083
   Iccyear37 |   .0007602   .0000662    11.48   0.000     .0006259    .0008946
   Iccyear38 |  -.0011022   .0002619    -4.21   0.000    -.0016333    -.000571
   Iccyear39 |   .0019871   .0000797    24.93   0.000     .0018254    .0021488
   Iccyear40 |    .003885   .0001008    38.56   0.000     .0036807    .0040894
   Iccyear41 |          0  (omitted)
       _cons |  -.0843783    .010934    -7.72   0.000    -.1065536   -.0622031
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. regress any_prio GPCP_g GPCP_g_l Iccode* $x_year, robust cluster(ccode)
note: Iccode36 omitted because of collinearity

Linear regression                               Number of obs     =        743
                                                F(1, 40)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7083
                                                Root MSE          =     .25395

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
    any_prio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |  -.0237702   .0432241    -0.55   0.585    -.1111295     .063589
    GPCP_g_l |  -.1219358   .0518326    -2.35   0.024    -.2266935   -.0171782
     Iccode1 |   1.441885   .0303444    47.52   0.000     1.380557    1.503213
     Iccode2 |    1.93397   .0312463    61.89   0.000     1.870819    1.997121
     Iccode3 |    1.70188   .0380177    44.77   0.000     1.625043    1.778716
     Iccode4 |   1.343308   .0320086    41.97   0.000     1.278616       1.408
     Iccode5 |   1.685641   .0345473    48.79   0.000     1.615818    1.755463
     Iccode6 |   1.679544   .0388832    43.19   0.000     1.600958    1.758129
     Iccode7 |    1.56617   .0431758    36.27   0.000     1.478908    1.653431
     Iccode8 |   1.686888   .0342693    49.22   0.000     1.617627    1.756149
     Iccode9 |   1.435753   .0331518    43.31   0.000     1.368751    1.502756
    Iccode10 |   1.886191   .0345198    54.64   0.000     1.816424    1.955958
    Iccode11 |   1.085978   .0342044    31.75   0.000     1.016848    1.155107
    Iccode12 |   1.216166   .0320991    37.89   0.000     1.151291     1.28104
    Iccode13 |   2.130065   .0343584    62.00   0.000     2.060625    2.199506
    Iccode14 |   1.854826   .0348393    53.24   0.000     1.784413    1.925239
    Iccode15 |   1.867542   .0340277    54.88   0.000      1.79877    1.936315
    Iccode16 |    1.68519    .035548    47.41   0.000     1.613344    1.757035
    Iccode17 |   1.696073   .0305654    55.49   0.000     1.634298    1.757848
    Iccode18 |   1.688489   .0336439    50.19   0.000     1.620492    1.756486
    Iccode19 |   2.808243   .0381939    73.53   0.000      2.73105    2.885435
    Iccode20 |   1.350326   .0297584    45.38   0.000     1.290182     1.41047
    Iccode21 |   2.790028   .0295119    94.54   0.000     2.730383    2.849674
    Iccode22 |    2.69731   .0287568    93.80   0.000      2.63919    2.755429
    Iccode23 |   1.903144   .0350038    54.37   0.000     1.832399    1.973889
    Iccode24 |   1.686478   .0343404    49.11   0.000     1.617073    1.755882
    Iccode25 |   1.313973   .0310326    42.34   0.000     1.251254    1.376693
    Iccode26 |   1.324828   .0306308    43.25   0.000     1.262921    1.386735
    Iccode27 |   2.714355   .0191111   142.03   0.000      2.67573     2.75298
    Iccode28 |    1.42864   .0248115    57.58   0.000     1.378495    1.478786
    Iccode29 |   2.773853   .0324873    85.38   0.000     2.708193    2.839512
    Iccode30 |   2.691252   .0322596    83.42   0.000     2.626053    2.756451
    Iccode31 |   3.205492   .0340283    94.20   0.000     3.136719    3.274266
    Iccode32 |   1.685918   .0348444    48.38   0.000     1.615495    1.756341
    Iccode33 |   1.437023   .0332197    43.26   0.000     1.369883    1.504162
    Iccode34 |    1.68787   .0351351    48.04   0.000     1.616859    1.758881
    Iccode35 |   3.194712   .0325348    98.19   0.000     3.128956    3.260467
    Iccode36 |          0  (omitted)
    Iccode37 |   1.574795   .0312952    50.32   0.000     1.511546    1.638045
    Iccode38 |   1.691209   .0324089    52.18   0.000     1.625709     1.75671
    Iccode39 |   1.693821   .0309405    54.74   0.000     1.631288    1.756354
    Iccode40 |   1.690667     .03203    52.78   0.000     1.625932    1.755402
    Iccode41 |     2.1976    .033379    65.84   0.000     2.130139    2.265062
    Iccyear1 |   .0294764   .0001592   185.14   0.000     .0291546    .0297981
    Iccyear2 |   -.015972   .0001116  -143.09   0.000    -.0161976   -.0157464
    Iccyear3 |   .0078254    .000501    15.62   0.000     .0068127     .008838
    Iccyear4 |   .0595386   .0000587  1014.28   0.000       .05942    .0596573
    Iccyear5 |   .0003619   .0001593     2.27   0.029     .0000399    .0006838
    Iccyear6 |   .0008518   .0005797     1.47   0.150    -.0003199    .0020235
    Iccyear7 |    .036931   .0010686    34.56   0.000     .0347713    .0390906
    Iccyear8 |  -.0000125   5.51e-06    -2.28   0.028    -.0000237   -1.40e-06
    Iccyear9 |   .0297377   .0001099   270.54   0.000     .0295156    .0299599
   Iccyear10 |  -.0031918   .0001654   -19.30   0.000     -.003526   -.0028576
   Iccyear11 |   .1090257   .0001661   656.33   0.000       .10869    .1093614
   Iccyear12 |   .0785764   .0003031   259.27   0.000     .0779639    .0791889
   Iccyear13 |  -.0281416   .0001333  -211.08   0.000    -.0284111   -.0278721
   Iccyear14 |  -.0051784   .0001213   -42.69   0.000    -.0054236   -.0049332
   Iccyear15 |  -.0105964   .0000885  -119.75   0.000    -.0107753   -.0104176
   Iccyear16 |   .0002246   .0001717     1.31   0.198    -.0001224    .0005716
   Iccyear17 |  -.0004801   .0001907    -2.52   0.016    -.0008655   -.0000948
   Iccyear18 |   .0000441    .000049     0.90   0.373    -.0000549    .0001431
   Iccyear19 |  -.0184829   .0005801   -31.86   0.000    -.0196553   -.0173104
   Iccyear20 |   .0414859    .000255   162.67   0.000     .0409705    .0420013
   Iccyear21 |  -.0379378   .0004297   -88.29   0.000    -.0388062   -.0370693
   Iccyear22 |  -.0094992   .0003777   -25.15   0.000    -.0102626   -.0087358
   Iccyear23 |  -.0132976   .0002935   -45.31   0.000    -.0138908   -.0127044
   Iccyear24 |  -.0000384   .0000279    -1.38   0.177    -.0000949     .000018
   Iccyear25 |   .0661605   .0002654   249.25   0.000      .065624     .066697
   Iccyear26 |   .0697059   .0002851   244.49   0.000     .0691297    .0702821
   Iccyear27 |  -.0014633   .0020767    -0.70   0.485    -.0056605     .002734
   Iccyear28 |   .0437223   .0014308    30.56   0.000     .0408306    .0466139
   Iccyear29 |  -.0245959   .0000617  -398.47   0.000    -.0247206   -.0244711
   Iccyear30 |  -.0003503   .0001447    -2.42   0.020    -.0006429   -.0000578
   Iccyear31 |  -.0736846   .0002182  -337.72   0.000    -.0741256   -.0732436
   Iccyear32 |    .000056   .0000552     1.01   0.316    -.0000555    .0001675
   Iccyear33 |   .0300685   .0001884   159.59   0.000     .0296877    .0304493
   Iccyear34 |   .0000789   .0003067     0.26   0.798     -.000541    .0006989
   Iccyear35 |  -.0683644   .0000573 -1192.51   0.000    -.0684803   -.0682485
   Iccyear36 |   .1133731   .0014005    80.95   0.000     .1105425    .1162037
   Iccyear37 |   .0141548   .0001414   100.11   0.000      .013869    .0144405
   Iccyear38 |   .0002215   .0001471     1.51   0.140    -.0000758    .0005189
   Iccyear39 |  -.0001457   .0000578    -2.52   0.016    -.0002625   -.0000289
   Iccyear40 |  -.0001798   .0001654    -1.09   0.284    -.0005141    .0001545
   Iccyear41 |   .0331156   .0000367   901.32   0.000     .0330413    .0331899
       _cons |   -1.68773   .0339283   -49.74   0.000    -1.756302   -1.619159
------------------------------------------------------------------------------

. regress war_prio GPCP_g GPCP_g_l Iccode* $x_year, robust cluster(ccode)
note: Iccode36 omitted because of collinearity

Linear regression                               Number of obs     =        743
                                                F(1, 40)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6991
                                                Root MSE          =     .21719

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
    war_prio |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      GPCP_g |  -.0624763   .0299194    -2.09   0.043    -.1229456    -.002007
    GPCP_g_l |  -.0686891   .0315953    -2.17   0.036    -.1325455   -.0048326
     Iccode1 |   1.601816   .0192227    83.33   0.000     1.562965    1.640666
     Iccode2 |   1.716672   .0197066    87.11   0.000     1.676844    1.756501
     Iccode3 |   1.705165   .0244554    69.73   0.000     1.655739    1.754591
     Iccode4 |   1.599528   .0202529    78.98   0.000     1.558595     1.64046
     Iccode5 |   1.711402   .0219291    78.04   0.000     1.667082    1.755722
     Iccode6 |   1.703677    .025071    67.95   0.000     1.653006    1.754347
     Iccode7 |   1.697002   .0279325    60.75   0.000     1.640548    1.753456
     Iccode8 |    1.71149   .0218311    78.40   0.000     1.667368    1.755612
     Iccode9 |   1.597775   .0210049    76.07   0.000     1.555323    1.640228
    Iccode10 |   1.763833    .021972    80.28   0.000     1.719426     1.80824
    Iccode11 |   1.512106   .0216593    69.81   0.000     1.468331    1.555881
    Iccode12 |   1.462898   .0202277    72.32   0.000     1.422016    1.503779
    Iccode13 |   1.710795   .0220355    77.64   0.000     1.666259     1.75533
    Iccode14 |    1.71032   .0222831    76.75   0.000     1.665285    1.755356
    Iccode15 |   1.711308   .0218156    78.44   0.000     1.667217    1.755399
    Iccode16 |   1.709154   .0227714    75.06   0.000     1.663131    1.755177
    Iccode17 |   1.716334    .019607    87.54   0.000     1.676707    1.755961
    Iccode18 |    1.71228   .0214622    79.78   0.000     1.668904    1.755657
    Iccode19 |   2.851715   .0247245   115.34   0.000     2.801745    2.901685
    Iccode20 |   1.370188   .0190786    71.82   0.000     1.331629    1.408747
    Iccode21 |   2.911556   .0186663   155.98   0.000      2.87383    2.949282
    Iccode22 |   2.920253   .0181269   161.10   0.000     2.883617    2.956889
    Iccode23 |   1.712187   .0218759    78.27   0.000     1.667974      1.7564
    Iccode24 |    1.71151   .0218453    78.35   0.000     1.667359    1.755661
    Iccode25 |   1.600873   .0196477    81.48   0.000     1.561164    1.640583
    Iccode26 |   1.412274    .019321    73.10   0.000     1.373224    1.451323
    Iccode27 |   1.150181   .0101062   113.81   0.000     1.129756    1.170607
    Iccode28 |   1.729677     .01485   116.48   0.000     1.699664     1.75969
    Iccode29 |   3.219885   .0205583   156.62   0.000     3.178335    3.261435
    Iccode30 |   2.840711   .0205522   138.22   0.000     2.799173    2.882248
    Iccode31 |   3.226647    .021938   147.08   0.000     3.182309    3.270985
    Iccode32 |   1.710528   .0222305    76.94   0.000     1.665599    1.755458
    Iccode33 |    1.46015   .0212211    68.81   0.000     1.417261     1.50304
    Iccode34 |   1.709038   .0227032    75.28   0.000     1.663153    1.754923
    Iccode35 |   3.219864   .0205768   156.48   0.000     3.178277    3.261452
    Iccode36 |          0  (omitted)
    Iccode37 |   1.717294   .0195757    87.73   0.000      1.67773    1.756858
    Iccode38 |   1.714048   .0206809    82.88   0.000      1.67225    1.755845
    Iccode39 |   1.716443   .0196768    87.23   0.000     1.676675    1.756211
    Iccode40 |   1.715267   .0202713    84.62   0.000     1.674297    1.756236
    Iccode41 |    2.30083   .0212236   108.41   0.000     2.257936    2.343724
    Iccyear1 |   .0138062    .000101   136.68   0.000     .0136021    .0140104
    Iccyear2 |  -.0001752   .0000758    -2.31   0.026    -.0003284   -.0000219
    Iccyear3 |   .0007869   .0003409     2.31   0.026      .000098    .0014758
    Iccyear4 |   .0139448    .000039   357.73   0.000      .013866    .0140236
    Iccyear5 |   .0002211   .0000992     2.23   0.032     .0000206    .0004217
    Iccyear6 |   .0009124   .0003978     2.29   0.027     .0001085    .0017164
    Iccyear7 |   .0016688   .0007207     2.32   0.026     .0002122    .0031253
    Iccyear8 |  -7.64e-06   3.43e-06    -2.23   0.032    -.0000146   -7.06e-07
    Iccyear9 |   .0138702   .0000764   181.54   0.000     .0137158    .0140247
   Iccyear10 |   .0002531   .0001094     2.31   0.026     .0000321    .0004742
   Iccyear11 |   .0361306   .0001144   315.76   0.000     .0358993    .0363618
   Iccyear12 |    .029351   .0002099   139.81   0.000     .0289267    .0297753
   Iccyear13 |   .0001401   .0000865     1.62   0.113    -.0000348     .000315
   Iccyear14 |   .0001796   .0000842     2.13   0.039     9.38e-06    .0003498
   Iccyear15 |   .0000816    .000056     1.46   0.153    -.0000316    .0001948
   Iccyear16 |   .0002693   .0001186     2.27   0.029     .0000296    .0005091
   Iccyear17 |  -.0001962   .0001073    -1.83   0.075    -.0004131    .0000207
   Iccyear18 |   .0000745   .0000341     2.19   0.035     5.62e-06    .0001433
   Iccyear19 |   -.046456   .0003993  -116.35   0.000    -.0472629    -.045649
   Iccyear20 |    .041789   .0001514   275.96   0.000     .0414829     .042095
   Iccyear21 |  -.0512326    .000287  -178.53   0.000    -.0518126   -.0506526
   Iccyear22 |  -.0479459   .0002496  -192.11   0.000    -.0484503   -.0474415
   Iccyear23 |   .0002283   .0001582     1.44   0.157    -.0000915     .000548
   Iccyear24 |  -.0000439   .0000193    -2.28   0.028    -.0000829   -5.00e-06
   Iccyear25 |   .0136282   .0001758    77.53   0.000     .0132729    .0139834
   Iccyear26 |   .0469212   .0001935   242.51   0.000     .0465302    .0473123
   Iccyear27 |   .1060135   .0014421    73.52   0.000      .103099     .108928
   Iccyear28 |  -.0022338   .0009914    -2.25   0.030    -.0042375   -.0002301
   Iccyear29 |  -.0772823   .0000427 -1808.40   0.000    -.0773687    -.077196
   Iccyear30 |  -.0194793   .0000862  -225.95   0.000    -.0196535   -.0193051
   Iccyear31 |  -.0734061   .0001475  -497.80   0.000    -.0737041   -.0731081
   Iccyear32 |   .0000849   .0000384     2.21   0.033     7.35e-06    .0001624
   Iccyear33 |     .03012   .0001302   231.27   0.000     .0298567    .0303832
   Iccyear34 |    .000418   .0002102     1.99   0.054    -6.78e-06    .0008427
   Iccyear35 |  -.0684677   .0000355 -1928.55   0.000    -.0685394   -.0683959
   Iccyear36 |   .1148096   .0008539   134.45   0.000     .1130838    .1165355
   Iccyear37 |  -.0001262    .000089    -1.42   0.164     -.000306    .0000536
   Iccyear38 |   .0002315   .0001008     2.30   0.027     .0000279    .0004352
   Iccyear39 |  -.0000478   .0000314    -1.52   0.135    -.0001111    .0000156
   Iccyear40 |  -.0002561   .0001149    -2.23   0.032    -.0004883   -.0000238
   Iccyear41 |   .0165385   .0000197   840.40   0.000     .0164987    .0165783
       _cons |  -1.711935   .0216264   -79.16   0.000    -1.755644   -1.668227
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. ivregress 2sls any_prio $x_fl $x_year (gdp_g gdp_g_l=GPCP_g GPCP_
> g_l), robust cluster(ccode) 

Instrumental variables (2SLS) regression          Number of obs   =
>         743
                                                  Wald chi2(50)   =
>       33.56
                                                  Prob > chi2     =
>      0.9641
                                                  R-squared       =
>      0.4012
                                                  Root MSE        =
>      .34267

                                 (Std. Err. adjusted for 41 cluster
> s in ccode)
-------------------------------------------------------------------
> -----------
             |               Robust
    any_prio |      Coef.   Std. Err.      z    P>|z|     [95% Conf
> . Interval]
-------------+-----------------------------------------------------
> -----------
       gdp_g |  -.4123911   1.410407    -0.29   0.770    -3.176737 
>    2.351955
     gdp_g_l |  -2.248935   1.023998    -2.20   0.028    -4.255933 
>   -.2419365
         y_0 |   .0529051   .0933508     0.57   0.571    -.1300591 
>    .2358693
    polity2l |   .0042769   .0057686     0.74   0.458    -.0070293 
>    .0155831
     ethfrac |   .5095896   .3757325     1.36   0.175    -.2268325 
>    1.246012
     relfrac |   .2221397   .4235856     0.52   0.600    -.6080728 
>    1.052352
         Oil |  -.1039195   .2083938    -0.50   0.618    -.5123639 
>    .3045249
      lpopl1 |    .159264   .0883821     1.80   0.072    -.0139617 
>    .3324897
     lmtnest |   .0602333   .0556499     1.08   0.279    -.0488384 
>    .1693051
    Iccyear1 |   .0161026      .0116     1.39   0.165     -.006633 
>    .0388383
    Iccyear2 |   .0119525   .0100461     1.19   0.234    -.0077376 
>    .0316425
    Iccyear3 |  -.0041126   .0136436    -0.30   0.763    -.0308537 
>    .0226284
    Iccyear4 |   .0268926   .0153629     1.75   0.080    -.0032182 
>    .0570034
    Iccyear5 |    -.00523   .0097595    -0.54   0.592    -.0243583 
>    .0138983
    Iccyear6 |   .0243198   .0177316     1.37   0.170    -.0104335 
>    .0590731
    Iccyear7 |   .0086869   .0085286     1.02   0.308    -.0080287 
>    .0254026
    Iccyear8 |  -.0321036   .0150359    -2.14   0.033    -.0615734 
>   -.0026339
    Iccyear9 |   .0009316    .010792     0.09   0.931    -.0202205 
>    .0220836
   Iccyear10 |  -.0005896   .0106366    -0.06   0.956    -.0214371 
>    .0202578
   Iccyear11 |   .0272155   .0149095     1.83   0.068    -.0020065 
>    .0564375
   Iccyear12 |    .023725   .0074863     3.17   0.002     .0090522 
>    .0383979
   Iccyear13 |  -.0185268   .0139037    -1.33   0.183    -.0457775 
>    .0087238
   Iccyear14 |   .0012726    .006412     0.20   0.843    -.0112948 
>    .0138399
   Iccyear15 |  -.0358446    .012112    -2.96   0.003    -.0595836 
>   -.0121055
   Iccyear16 |  -.0496094   .0228555    -2.17   0.030    -.0944054 
>   -.0048135
   Iccyear17 |   .0033212   .0159989     0.21   0.836     -.028036 
>    .0346784
   Iccyear18 |  -.0148818   .0111793    -1.33   0.183    -.0367928 
>    .0070291
   Iccyear19 |   .0333914   .0094743     3.52   0.000     .0148221 
>    .0519606
   Iccyear20 |   .0210484   .0129415     1.63   0.104    -.0043164 
>    .0464133
   Iccyear21 |  -.0169132   .0140974    -1.20   0.230    -.0445437 
>    .0107173
   Iccyear22 |   .0242107   .0125991     1.92   0.055    -.0004831 
>    .0489046
   Iccyear23 |  -.0446029   .0135638    -3.29   0.001    -.0711875 
>   -.0180183
   Iccyear24 |  -.0460342   .0140326    -3.28   0.001    -.0735375 
>   -.0185308
   Iccyear25 |    .034466    .011475     3.00   0.003     .0119753 
>    .0569566
   Iccyear26 |   .0371357   .0111931     3.32   0.001     .0151976 
>    .0590738
   Iccyear27 |   .1165972    .032618     3.57   0.000      .052667 
>    .1805274
   Iccyear28 |   .0481939   .0240009     2.01   0.045      .001153 
>    .0952348
   Iccyear29 |   .0011747   .0156495     0.08   0.940    -.0294979 
>    .0318472
   Iccyear30 |   .0445844   .0156909     2.84   0.004     .0138308 
>    .0753381
   Iccyear31 |   .0075697   .0126415     0.60   0.549    -.0172071 
>    .0323465
   Iccyear32 |  -.0226275   .0081526    -2.78   0.006    -.0386063 
>   -.0066487
   Iccyear33 |  -.0027062   .0108102    -0.25   0.802    -.0238939 
>    .0184814
   Iccyear34 |  -.0199633   .0081382    -2.45   0.014    -.0359139 
>   -.0040127
   Iccyear35 |  -.0217231   .0282695    -0.77   0.442    -.0771302 
>    .0336841
   Iccyear36 |    .006345   .0141198     0.45   0.653    -.0213293 
>    .0340193
   Iccyear37 |   .0106867   .0124698     0.86   0.391    -.0137536 
>     .035127
   Iccyear38 |   .0106667   .0114106     0.93   0.350    -.0116976 
>    .0330311
   Iccyear39 |   .0052874   .0123032     0.43   0.667    -.0188264 
>    .0294012
   Iccyear40 |  -.0162993   .0147223    -1.11   0.268    -.0451545 
>    .0125558
   Iccyear41 |   .0392157   .0156994     2.50   0.012     .0084453 
>     .069986
       _cons |   -1.74486   .6524492    -2.67   0.007    -3.023637 
>   -.4660832
-------------------------------------------------------------------
> -----------
Instrumented:  gdp_g gdp_g_l
Instruments:   y_0 polity2l ethfrac relfrac Oil lpopl1 lmtnest
               Iccyear1 Iccyear2 Iccyear3 Iccyear4 Iccyear5
               Iccyear6 Iccyear7 Iccyear8 Iccyear9 Iccyear10
               Iccyear11 Iccyear12 Iccyear13 Iccyear14 Iccyear15
               Iccyear16 Iccyear17 Iccyear18 Iccyear19 Iccyear20
               Iccyear21 Iccyear22 Iccyear23 Iccyear24 Iccyear25
               Iccyear26 Iccyear27 Iccyear28 Iccyear29 Iccyear30
               Iccyear31 Iccyear32 Iccyear33 Iccyear34 Iccyear35
               Iccyear36 Iccyear37 Iccyear38 Iccyear39 Iccyear40
               Iccyear41 GPCP_g GPCP_g_l

. ivreg2 any_prio $x_fl $x_year (gdp_g gdp_g_l=GPCP_g GPCP_g_l), ro
> bust cluster(ccode) 
command ivreg2 is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\Lorena\AppData\Local\Temp\STD105c_000000.tmp"

. ivregress 2sls any_prio $x_fl $x_year (gdp_g gdp_g_l=GPCP_g GPCP_g_l), robust cluster(ccode) 

Instrumental variables (2SLS) regression          Number of obs   =        743
                                                  Wald chi2(50)   =      33.56
                                                  Prob > chi2     =     0.9641
                                                  R-squared       =     0.4012
                                                  Root MSE        =     .34267

                                 (Std. Err. adjusted for 41 clusters in ccode)
------------------------------------------------------------------------------
             |               Robust
    any_prio |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       gdp_g |  -.4123911   1.410407    -0.29   0.770    -3.176737    2.351955
     gdp_g_l |  -2.248935   1.023998    -2.20   0.028    -4.255933   -.2419365
         y_0 |   .0529051   .0933508     0.57   0.571    -.1300591    .2358693
    polity2l |   .0042769   .0057686     0.74   0.458    -.0070293    .0155831
     ethfrac |   .5095896   .3757325     1.36   0.175    -.2268325    1.246012
     relfrac |   .2221397   .4235856     0.52   0.600    -.6080728    1.052352
         Oil |  -.1039195   .2083938    -0.50   0.618    -.5123639    .3045249
      lpopl1 |    .159264   .0883821     1.80   0.072    -.0139617    .3324897
     lmtnest |   .0602333   .0556499     1.08   0.279    -.0488384    .1693051
    Iccyear1 |   .0161026      .0116     1.39   0.165     -.006633    .0388383
    Iccyear2 |   .0119525   .0100461     1.19   0.234    -.0077376    .0316425
    Iccyear3 |  -.0041126   .0136436    -0.30   0.763    -.0308537    .0226284
    Iccyear4 |   .0268926   .0153629     1.75   0.080    -.0032182    .0570034
    Iccyear5 |    -.00523   .0097595    -0.54   0.592    -.0243583    .0138983
    Iccyear6 |   .0243198   .0177316     1.37   0.170    -.0104335    .0590731
    Iccyear7 |   .0086869   .0085286     1.02   0.308    -.0080287    .0254026
    Iccyear8 |  -.0321036   .0150359    -2.14   0.033    -.0615734   -.0026339
    Iccyear9 |   .0009316    .010792     0.09   0.931    -.0202205    .0220836
   Iccyear10 |  -.0005896   .0106366    -0.06   0.956    -.0214371    .0202578
   Iccyear11 |   .0272155   .0149095     1.83   0.068    -.0020065    .0564375
   Iccyear12 |    .023725   .0074863     3.17   0.002     .0090522    .0383979
   Iccyear13 |  -.0185268   .0139037    -1.33   0.183    -.0457775    .0087238
   Iccyear14 |   .0012726    .006412     0.20   0.843    -.0112948    .0138399
   Iccyear15 |  -.0358446    .012112    -2.96   0.003    -.0595836   -.0121055
   Iccyear16 |  -.0496094   .0228555    -2.17   0.030    -.0944054   -.0048135
   Iccyear17 |   .0033212   .0159989     0.21   0.836     -.028036    .0346784
   Iccyear18 |  -.0148818   .0111793    -1.33   0.183    -.0367928    .0070291
   Iccyear19 |   .0333914   .0094743     3.52   0.000     .0148221    .0519606
   Iccyear20 |   .0210484   .0129415     1.63   0.104    -.0043164    .0464133
   Iccyear21 |  -.0169132   .0140974    -1.20   0.230    -.0445437    .0107173
   Iccyear22 |   .0242107   .0125991     1.92   0.055    -.0004831    .0489046
   Iccyear23 |  -.0446029   .0135638    -3.29   0.001    -.0711875   -.0180183
   Iccyear24 |  -.0460342   .0140326    -3.28   0.001    -.0735375   -.0185308
   Iccyear25 |    .034466    .011475     3.00   0.003     .0119753    .0569566
   Iccyear26 |   .0371357   .0111931     3.32   0.001     .0151976    .0590738
   Iccyear27 |   .1165972    .032618     3.57   0.000      .052667    .1805274
   Iccyear28 |   .0481939   .0240009     2.01   0.045      .001153    .0952348
   Iccyear29 |   .0011747   .0156495     0.08   0.940    -.0294979    .0318472
   Iccyear30 |   .0445844   .0156909     2.84   0.004     .0138308    .0753381
   Iccyear31 |   .0075697   .0126415     0.60   0.549    -.0172071    .0323465
   Iccyear32 |  -.0226275   .0081526    -2.78   0.006    -.0386063   -.0066487
   Iccyear33 |  -.0027062   .0108102    -0.25   0.802    -.0238939    .0184814
   Iccyear34 |  -.0199633   .0081382    -2.45   0.014    -.0359139   -.0040127
   Iccyear35 |  -.0217231   .0282695    -0.77   0.442    -.0771302    .0336841
   Iccyear36 |    .006345   .0141198     0.45   0.653    -.0213293    .0340193
   Iccyear37 |   .0106867   .0124698     0.86   0.391    -.0137536     .035127
   Iccyear38 |   .0106667   .0114106     0.93   0.350    -.0116976    .0330311
   Iccyear39 |   .0052874   .0123032     0.43   0.667    -.0188264    .0294012
   Iccyear40 |  -.0162993   .0147223    -1.11   0.268    -.0451545    .0125558
   Iccyear41 |   .0392157   .0156994     2.50   0.012     .0084453     .069986
       _cons |   -1.74486   .6524492    -2.67   0.007    -3.023637   -.4660832
------------------------------------------------------------------------------
Instrumented:  gdp_g gdp_g_l
Instruments:   y_0 polity2l ethfrac relfrac Oil lpopl1 lmtnest Iccyear1
               Iccyear2 Iccyear3 Iccyear4 Iccyear5 Iccyear6 Iccyear7
               Iccyear8 Iccyear9 Iccyear10 Iccyear11 Iccyear12 Iccyear13
               Iccyear14 Iccyear15 Iccyear16 Iccyear17 Iccyear18 Iccyear19
               Iccyear20 Iccyear21 Iccyear22 Iccyear23 Iccyear24 Iccyear25
               Iccyear26 Iccyear27 Iccyear28 Iccyear29 Iccyear30 Iccyear31
               Iccyear32 Iccyear33 Iccyear34 Iccyear35 Iccyear36 Iccyear37
               Iccyear38 Iccyear39 Iccyear40 Iccyear41 GPCP_g GPCP_g_l

. 
end of do-file

. exit, clear
